test/asciiart-load-test.yaml
config:
  target: http://localhost:3000
  phases:
    # - duration: 60
    #   arrivalRate: 1
    #   rampTo: 5
    #   name: Warm up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: Ramp up load
    # - duration: 30
    #   arrivalRate: 1
    #   rampTo: 500
    #   name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 700
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - name: 'Simple GET request'
    flow:
      - get:
          url: '/raffles'
      - get:
          url: '/news'
      - get:
          url: '/markets?page=1'